var tipuesearch = {"pages": [{
    "title": "Docker 알아보기",
    "text": "1. 도커를 사용하기 전… 새로운 프로그램 개발을 시작할 때 “환경 설정”이라는 과정을 거치게된다. 예를들어 Java 어플리케이션 개발을 시작하기 위해서 JDK를 설치하거나, Python 어플리케이션 개발을 시작하기 위해서 Python을 설치하는 등 개발에 필수적인 프로그램을 설치하는 과정을 거치게된다. 거기에 더 나아가 특별한 기능을 프로그램에 추가하기 위해서 각 프로그램 언어별로 프레임워크, 라이브러리 등을 설치하는 과정도 발생한다. 이러한 과정은 반복적이지만 개발 초기에 반드시 실행되어야하는 과정이다. 개발 단계에서 이런 문제들은 개발 환경에 설치된 OS, 하드웨어에 맞는 환경 설정을 맞춰나가면 된다. 예를들어 ‘django’ 기반의 웹 서비스 어플리케이션을 개발하려고 하는데, django가 설치되어 있지 않아 위의 이미지와 같은 에러가 발생한 경우는 pip install django와 같은 방법을 통해 해당 환경에 ‘django’ 모듈을 설치하면 된다. 그렇게 완성한 환경 설정을",
    "tags": "docker",
    "url": "/categories/docker/docker-%EC%8B%9C%EC%9E%91%ED%95%98%EA%B8%B0.html"
  }]};
